diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыЗаПериод</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаАбоненскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_ТипСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СтоимостьЧасаРаботы</name>
    <type>
      <types>DefinedType.ВКМ_ТипСумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
Функция ЗаполнитьНаСервере(ДатаНачала, ДатаОкончания) Экспорт
  
  Запрос = Новый Запрос;
  Запрос.Текст = "ВЫБРАТЬ
                 |  РеализацияТоваровУслуг.Ссылка КАК Ссылка
                 |ПОМЕСТИТЬ ВТ_Реализации
                 |ИЗ
                 |  Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
                 |ГДЕ
                 |  РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
                 |  И НЕ РеализацияТоваровУслуг.ПометкаУдаления
                 |;
                 |
                 |////////////////////////////////////////////////////////////////////////////////
                 |ВЫБРАТЬ
                 |  ДоговорыКонтрагентов.Ссылка КАК Договор,
                 |  ВТ_Реализации.Ссылка КАК Реализация
                 |ИЗ
                 |  ВТ_Реализации КАК ВТ_Реализации
                 |    ПРАВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                 |    ПО (ДоговорыКонтрагентов.Ссылка = ВТ_Реализации.Ссылка.Договор)
                 |ГДЕ
                 |  ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
  
  Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
  Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
  Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
  
  Выборка = Запрос.Выполнить().Выбрать();
  
  СписокРеализацийМассив = Новый Массив;
  
  Пока Выборка.Следующий() Цикл
    
    СписокРеализацийСтруктура = Новый Структура;
    
    Если НЕ ЗначениеЗаполнено(Выборка.Реализация) Тогда
      НоваяРеализация = СоздатьНовыйРеализация(Выборка.Договор, ДатаОкончания);
      СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор);
      СписокРеализацийСтруктура.Вставить("Реализация", НоваяРеализация);
      
    Иначе
      СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор);
      СписокРеализацийСтруктура.Вставить("Реализация", Выборка.Реализация);
      
    КонецЕсли;
    
    СписокРеализацийМассив.Добавить(СписокРеализацийСтруктура);
    
  КонецЦикла;
  
  Возврат СписокРеализацийМассив;
  
КонецФункции

Функция СоздатьНовыйРеализация(Договор, ДатаСозданияНовойРеализации)
  
  НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
  НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение(Договор, ДатаСозданияНовойРеализации);
  НоваяРеализация.Дата = ДатаСозданияНовойРеализации;
  //НоваяРеализация.Ответственный = Пользователи.ТекущийПользователь();
  НоваяРеализация.Договор = Договор;
  НоваяРеализация.Контрагент = Договор.Владелец;
  НоваяРеализация.Организация = Договор.Организация;
  НоваяРеализация.Комментарий = "Создано обработкой";
  НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
  
  Возврат НоваяРеализация.Ссылка;
  
КонецФункции
